#ifndef __triangle__
#define __triangle__

//------------------------------------------------------------------------------
// triangle.h - содержит описание треугольника
//------------------------------------------------------------------------------

#include "stdio.h"
#include "random.h"

// треугольник
struct triangle {
    int x_1, y_1; // координаты 1го угла
    int x_2, y_2; // координаты 2го угла
    int x_3, y_3; // координаты 3го угла
};

// Ввод параметров треугольника из файла
void In(triangle& t, FILE *file);

// Случайный ввод параметров треугольника
void InRnd(triangle& t);

// Вывод параметров треугольника в форматируемый поток
void Out(triangle& t, FILE* file);

// Вычисление периметра треугольника
double Perimeter(triangle& t);

#endif //__triangle__
