#ifndef __circle__
#define __circle__

//------------------------------------------------------------------------------
// circle.h - содержит описание круга
//------------------------------------------------------------------------------

#include "stdio.h"
#include "random.h"

// круг
struct circle {
    int x_c, y_c; // координаты центра
    int r; // радиус
};

// Ввод параметров круга из файла
void In(circle& с, FILE* file);

// Случайный ввод параметров круга
void InRnd(circle& с);

// Вывод параметров круга в форматируемый поток
void Out(circle& с, FILE* file);

// Вычисление длины круга
double Perimeter(circle& с);

#endif //__circle__
